---
kind: method
id: M:Autodesk.Revit.DB.ScheduleFilter.SetNullValue
source: html/2c193a4c-37fd-0b4d-a026-d9dfd773c16b.htm
---
# Autodesk.Revit.DB.ScheduleFilter.SetNullValue Method

Sets the filter to have no specified value (used for HasParameter filters).

## Syntax (C#)
```csharp
public void SetNullValue()
```